app/controllers/students_controller.rb

  def create
      #@student = Student.new
      @student = Student.new(params[:student])
      @student.sname = params[:sname]
      @student.smarks = params[:smarks]
      #
        respond_to do |format|
          if @student.save
---
INSERT INTO `students` (`created_at`, `smarks`, `sname`, `updated_at`) VALUES ('2014-07-09 11:34:12', 12548, 'apple', '2014-07-09 11:34:12')

  def show
    @student = Student.find(params[:id])
---
SELECT `students`.* FROM `students` WHERE `students`.`id` = 7 LIMIT 1

  def edit
    @student = Student.find(params[:id])
---
SELECT `students`.* FROM `students` WHERE `students`.`id` = 10 LIMIT 1

  def update
    @student = Student.find(params[:id])
    @student.sname = params[:student][:sname]
    @student.smarks = params[:student][:smarks]
      respond_to do |format|
        if @student.save
---
SELECT `students`.* FROM `students` WHERE `students`.`id` = 22 LIMIT 1
UPDATE `students` SET `sname` = 'update student', `updated_at` = '2014-07-09 12:00:12' WHERE `students`.`id` = 22

  def destroy
    @student = Student.find(params[:id]).destroy
---
DELETE FROM `students` WHERE `students`.`id` = 36
SELECT `students`.* FROM `students` WHERE `students`.`id` = 36 LIMIT 1